
[
  {
    "courseId": 1,
    "courseName": "Introduction to Programming",
    "instructor": "John Doe",
    "duration": "8 weeks",
    "topics": ["Basic Concepts", "Variables", "Control Flow", "Functions", "Data Structures", "Algorithm Design"],
    "level": "Beginner",
    "price": 49.99,
    "photoUrl": " https://i.ibb.co/XFbykGG/EDL221-Intro-to-Programming-1a.jpg",
    "shortDescription": "Designed for beginners, this course covers the fundamentals of programming. Students will have a solid foundation in programming by the end.",
    "description": "Designed for beginners, this course covers the fundamentals of programming. Starting with basic concepts, students progress through topics like variables, control flow, and functions. By the end, they'll have a solid foundation in programming. Emphasizing hands-on coding exercises and projects, learners reinforce their understanding. This interactive approach ensures practical application of theoretical knowledge. With engaging projects, participants develop problem-solving skills crucial for success. This course equips students with both theoretical knowledge and practical skills, preparing them for further exploration in programming.",
    "dailyBreakdown": [
      "Day 1: Introduction to Programming Concepts",
      "Day 2: Understanding Variables and Data Types",
      "Day 3: Control Flow and Decision Making",
      "Day 4: Functions and Modular Programming",
      "Day 5: Hands-on Coding Exercise",
      "Day 6: Project Showcase and Q&A Session",
      "Day 7: Review and Recap",
      "Day 8: Final Assessment"
    ]
  },
  {
    "courseId": 2,
    "courseName": "Web Development Bootcamp",
    "instructor": "Jane Smith",
    "duration": "12 weeks",
    "topics": ["HTML", "CSS", "JavaScript", "Node.js", "React", "Responsive Design"],
    "level": "Intermediate",
    "price": 99.99,
    "photoUrl": "https://i.ibb.co/Pz42TR2/Teachable-Thumbnails-1.png",
    "shortDescription": "An intensive bootcamp covering the essentials of web development. The course concludes with a deep dive into React for building modern, interactive web applications.",
    "description": "This intensive bootcamp covers web development essentials, starting with HTML for building static web pages, CSS for styling, and JavaScript for dynamic client-side interactions. It progresses to server-side development with Node.js and concludes with an in-depth exploration of React for building modern, interactive web applications. Participants engage in real-world projects to apply their skills and gain practical experience, ensuring they're equipped with hands-on expertise. Through this comprehensive curriculum, learners develop a strong foundation in web development, preparing them for success in the dynamic field of modern web application development.",
    "dailyBreakdown": [
      "Week 1: HTML Fundamentals",
      "Week 2: CSS Styling Techniques",
      "Week 3: Introduction to JavaScript and DOM Manipulation",
      "Week 4: Server-side Development with Node.js",
      "Week 5: React Basics and Component-Based Architecture",
      "Week 6: Advanced React Concepts",
      "Week 7: Project Development Phase",
      "Week 8: Project Showcase and Feedback Session",
      "Week 9: Optimization Techniques in Web Development",
      "Week 10: Final Project Presentation and Graduation Ceremony"
    ]
  },
  {
    "courseId": 3,
    "courseName": "Data Science Fundamentals",
    "instructor": "Michael Johnson",
    "duration": "10 weeks",
    "topics": ["Statistics", "Python", "Data Analysis", "Machine Learning", "Data Visualization", "Predictive Modeling"],
    "level": "Intermediate",
    "price": 79.99,
    "photoUrl": "https://i.ibb.co/Z8x0QzQ/course-12930-image.jpg",
    "shortDescription": "Explore the world of data science with this comprehensive course. The course delves into machine learning, covering algorithms and techniques for extracting meaningful insights from data.",
    "description": "Delve into data science with this comprehensive course, beginning with statistical concepts and mastering Python for data analysis and manipulation. Explore machine learning algorithms for extracting valuable insights from data. Engage in hands-on projects with real-world datasets to gain practical experience. Through this immersive curriculum, participants develop a strong foundation in data science, equipping them with the skills to tackle complex analytical challenges and derive meaningful insights from vast datasets. With a focus on practical application and real-world projects, learners emerge prepared to excel in the dynamic field of data science, ready to address industry demands and drive innovation.",
    "dailyBreakdown": [
      "Week 1-2: Statistical Concepts and Data Exploration",
      "Week 3-4: Introduction to Python for Data Science",
      "Week 5-6: Data Analysis Techniques and Visualization",
      "Week 7-8: Fundamentals of Machine Learning",
      "Week 9-10: Advanced Machine Learning Concepts",
      "Week 11-12: Practical Applications and Real-world Projects"
    ]
  },
  {
    "courseId": 4,
    "courseName": "Advanced JavaScript Concepts",
    "instructor": "Emily Brown",
    "duration": "6 weeks",
    "topics": ["ES6+", "Asynchronous JavaScript", "Closures", "Promises", "Functional Programming", "Error Handling"],
    "level": "Advanced",
    "price": 69.99,
    "photoUrl": "   https://i.ibb.co/R6FSGs5/1-t-UPYEFBd-LN0d-DT6-Dzd-Is-OA.png",
    "shortDescription": "Take your JavaScript skills to the next level with this advanced course. Participants will have a strong grasp of advanced JavaScript concepts by the end.",
    "description": "Elevate your JavaScript expertise with this advanced course, delving into ECMAScript 6 (ES6+) features, asynchronous programming, closures, and promises. Participants gain a comprehensive understanding of advanced JavaScript concepts, equipped to tackle intricate coding challenges. Through practical exercises and a final project, learners apply newfound knowledge in real-world scenarios, solidifying their skills. By course completion, participants possess a robust grasp of advanced JavaScript principles, prepared to navigate complex programming tasks with confidence. This immersive learning experience empowers individuals to harness the full potential of JavaScript and excel in dynamic software development environments.",
    "dailyBreakdown": [
      "Week 1: Exploring ES6+ Features and Enhancements",
      "Week 2: Deep Dive into Asynchronous JavaScript and Event Loop",
      "Week 3: Understanding Closures and Scope",
      "Week 4: Promises and Asynchronous Patterns",
      "Week 5: Advanced CodingChallenges",
      "Week 6: Final Project Development and Presentation"
    ]
  }
]