
[
  {
    "job_title": "Software Engineer",
    "company_name": "JB Connect Limited",
    "company_logo": "https://i.ibb.co/cTQpSTh/jb-connect-limited-logo.jpg",
    "job_role": "React Developer",
    "salary": 8000,
    "job_time": "Full-time",
    "skills": ["JavaScript", "React", "Node.js", "NoSQL", "Tailwind CSS"],
    "job_description": "We are seeking a skilled and enthusiastic React.js Developer to join our dynamic development team. The ideal candidate will be responsible for building responsive and engaging user interfaces, collaborating with cross-functional teams to deliver high-quality web applications.",
    "hiring_manager_name": "Alexandra Johnson",
    "hiring_manager_photo": "https://i.ibb.co/Z8M4SWM/comment-people-2.png",
    "hiring_manager_email": "jbconnect@gmail.com",
    "responsibilities": ["Develop new user-facing features using React.js while ensuring the technical feasibility of UI/UX designs.", "Collaborate with product managers, designers, and other developers to translate business requirements into high-quality code","Build reusable components and front-end libraries for future use.","Participate in code reviews to maintain code quality and provide constructive feedback to peers.","Troubleshoot and debug issues, and work closely with the QA team to address bugs and other issues.","Contribute to the continuous improvement of development processes and tools."],
    "benefits": ["Health insurance", "Flexible work hours", "Professional development opportunities"],
    "qualification": ["Bachelor's degree in Computer Science or related field","Proven experience as a React.js Developer with a strong portfolio of projects.","Experience with state management libraries such as Redux or Context API.","Knowledge of modern front-end build pipelines and tools (e.g., Webpack, Babel).","Understanding of version control systems, such as Git.","Excellent problem-solving skills and attention to detail.","Ability to work in an agile and fast-paced environment"],
    "job_posting_date": "2024-01-21",
    "user_email": "mahi@gmail.com",
    "job_location": "San Francisco, CA"
  },
  {
    "job_title": "iOS Developer",
    "company_name": "Editr Apps",
    "company_logo": "https://i.ibb.co/xg8bYtz/1705196395659.jpg",
    "job_role": "iOS Developer",
    "salary": 60000,
    "job_time": "Hybrid",
    "skills": ["Kaggle", "Objective-C", "iOS Development"],
    "job_description": "This is an opportunity for someone who is passionate coding have lots of problem solving experience (Leetcode, Kaggle, ICPC, Topcoder etc.).Participate in the creation of top ranking world class mobile applications whose usage cross over millions of iPhone app users." ,
    "hiring_manager_name": "Christopher Davis",
    "hiring_manager_photo": "https://i.ibb.co/Cs2cLjg/comment-people-5.png",
    "hiring_manager_email": "editrapps@gmail.com",
    "responsibilities": ["Participate in software development using Waterfall/ Agile/Scrum development process.", "Analyze product requirements and propose solutions to them.","Implement the feature/functionality specified in the product requirements." ,"Quickly adapt to new development environments and changing business requirements" ,"Constantly follow a hardworking, dedicated approach to deliver timely and well structured code","Write design specifications and other development documentation."],
    "benefits": ["Remote work options", "Paid time off", "401(k)","Flexible office hours: Sunday to Thursday.","Highly Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Growing startup.","Most importantly, a friendly work environment with opportunity to learn & share among a number of highly skilled mentors."],
    "qualification": ["Bachelor's degree in Marketing or related field","Github repository link, StackOverflow or similar programming related site (Leetcode, Kaggle, ICPC, Topcoder etc.)'s profile links.","Ability to communicate clearly and concisely both in writing and orally.","Exposure to complex Camera / Video technologies is a plus."],
    "job_posting_date": "2024-01-21",
    "user_email": "mahi@gamil.com",
    "job_location": "Dhaka, Bangladesh"
  },
  {
    "job_title": "Data Scientist",
    "company_name": "Innovate Analytics Solutions",
    "company_logo": "https://i.ibb.co/Npm8YD1/iqvia-logo.jpg",
    "job_role": "Machine Learning Engineer",
    "salary": 90000,
    "job_time": "Full-time",
    "skills": ["Python", "Machine Learning", "Data Analysis"],
    "job_description": "As a Machine learning engineer, you will develop algorithms that enhance the daily life and professional outcomes of our end-users. You will join a team of other ML engineers / data scientists, big data, and software engineers, all responsible for the delivery of algorithms through the Orchestrated Analytics Platform from the ground up. You will work with product and business stakeholders to deliver algorithms with very clear business objectives, including requirements gathering, model development, prototyping, and interfacing with the software engineering team. Ideal candidates will bring a well-rounded skillset capable of spanning customer-focus, data science and software development disciplines to shape early-stage ideas into fully assessed, designed, and implemented machine learning solutions.",
    "hiring_manager_name": "Dr. Emily Rodriguez",
    "hiring_manager_photo": "https://i.ibb.co/swXD40B/comment-people-4.png",
    "hiring_manager_email": "Innovate@gmail.com",
    "responsibilities": ["Work closely with non-technical stakeholders to successfully execute ML models and algorithms in the platform. ", "Analyze large datasets","Interface with software engineering & Algorithm SME team for the development of the product." , "Design and develop proof-of-concept solutions as needed using ML Products." , "Mentor and coach junior team members. Educate leadership team to bring up to speed with technical advances." , "Build, Own and Support production grade, scalable algorithms in the Next Best ML Platform."],
    "benefits": ["Health and dental coverage", "Remote work flexibility", "Stock options"],
    "qualification": ["Master's degree in Data Science or related field","5+ years’ experience working on creating and deploying machine learning algorithms.","Creative problem solver with a strong knowledge of statistics/data analytics, and machine learning methods and strategies.","Experience with software engineering best practices (programming, testing, version control, agile development, etc.)","Excellent communication (written and oral) and interpersonal skills"],
    "job_posting_date": "2024-01-21",
    "user_email": "mahi@gamil.com",
    "job_location": "Seattle, WA"
  },
  {
    "job_title": "Graphic Designer",
    "company_name": "Creative Designs Co",
    "company_logo": "https://i.ibb.co/xjvM2Dz/1631316305616.jpg",
    "job_role": "Visual Communication Specialist",
    "salary": 6000,
    "job_time": "Full-time",
    "skills": ["Adobe Creative Suite", "Typography", "Illustration"],
    "job_description": "Britannia Garment Packaging is a global supplier of labelling and packaging solutions to the garment industry. Headquartered in the UK, we provide labelling and packaging for leading retailers and prominent brands around the world. With nearly 500 employees and a proud heritage in British garment packaging, we are a growing business with a global network of production facilities.",
    "hiring_manager_name": "Sheikh Sirajul Islam Joni",
    "hiring_manager_photo": "https://i.ibb.co/g4zJ7q7/comment-people-1.png",
    "hiring_manager_email": "Sheikh@gmail.com",
    "responsibilities": ["Create graphics for print and digital media", "Collaborate with marketing team","This full-time on-site role is for a Digital Press Operator located in Dhaka. The Digital Press Operator will be responsible for operating and maintaining digital printing equipment in a fast-paced production environment, ensuring accurate and high-quality output. The Operator should have experience with digital printing equipment, be able to perform routine maintenance and cleaning of the equipment, and troubleshoot or escalate any issues that may arise."],
    "benefits": ["Casual dress code", "Flexible scheduling", "Employee discount program"],
    "qualification": ["Bachelor's degree in Graphic Design or related field","Proficient in using digital printers and RIP software, as well as Adobe Creative Suite","Experience troubleshooting print quality issues and performing routine equipment maintenance","Excellent communication and interpersonal skills with the ability to work collaboratively in a team environment","Demonstrated ability to work effectively in a fast-paced, deadline-driven environment","Experience with packaging, printing, and/or the garment industry is preferred"],
    "job_posting_date": "2024-01-21",
    "user_email": "mahi@gamil.com",
    "job_location": "Los Angeles, USA"
  }
]
